#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/namitjagtiani/gh-actions-demo/runs/run-1JrJd542kmrXceQb

Waiting for the plan to start...

Terraform v0.15.0
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
random_pet.sg: Refreshing state... [id=leading-insect]
azurerm_virtual_network.example: Refreshing state... [id=/subscriptions/8e490e06-ec73-4972-88b1-1e89d8aabe8c/resourceGroups/wus-rg/providers/Microsoft.Network/virtualNetworks/virtualNetwork1]
azurerm_resource_group.wus-rg: Refreshing state... [id=/subscriptions/8e490e06-ec73-4972-88b1-1e89d8aabe8c/resourceGroups/wus-rg]
azurerm_network_security_group.wus-nsg: Refreshing state... [id=/subscriptions/8e490e06-ec73-4972-88b1-1e89d8aabe8c/resourceGroups/wus-rg/providers/Microsoft.Network/networkSecurityGroups/NSGS1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # azurerm_firewall.wus-azfw will be created
  + resource "azurerm_firewall" "wus-azfw" {
      + id                  = (known after apply)
      + location            = "westus"
      + name                = "wus-azfw"
      + resource_group_name = "wus-rg"
      + sku_name            = (known after apply)
      + sku_tier            = "Standard"
      + threat_intel_mode   = "Alert"

      + ip_configuration {
          + name                 = "configuration"
          + private_ip_address   = (known after apply)
          + public_ip_address_id = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # azurerm_public_ip.wus-azfw-pip will be created
  + resource "azurerm_public_ip" "wus-azfw-pip" {
      + allocation_method       = "Static"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "westus"
      + name                    = "wus-azfw-pip"
      + resource_group_name     = "wus-rg"
      + sku                     = "Standard"
    }

  # azurerm_route_table.wus-rt will be created
  + resource "azurerm_route_table" "wus-rt" {
      + disable_bgp_route_propagation = false
      + id                            = (known after apply)
      + location                      = "westus"
      + name                          = "example-routetable"
      + resource_group_name           = "wus-rg"
      + route                         = [
          + {
              + address_prefix         = "0.0.0.0"
              + name                   = "example"
              + next_hop_in_ip_address = "10.10.1.1"
              + next_hop_type          = "VirtualAppliance"
            },
        ]
      + subnets                       = (known after apply)
    }

  # azurerm_subnet_route_table_association.wus-rt-association-1 will be created
  + resource "azurerm_subnet_route_table_association" "wus-rt-association-1" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # azurerm_subnet_route_table_association.wus-rt-association-2 will be created
  + resource "azurerm_subnet_route_table_association" "wus-rt-association-2" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # azurerm_subnet_route_table_association.wus-rt-association-3 will be created
  + resource "azurerm_subnet_route_table_association" "wus-rt-association-3" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # azurerm_virtual_network.example will be destroyed
  - resource "azurerm_virtual_network" "example" {
      - address_space         = [
          - "10.0.0.0/16",
        ] -> null
      - dns_servers           = [
          - "10.0.0.4",
          - "10.0.0.5",
        ] -> null
      - guid                  = "ca69bbab-c310-49de-a50f-b67d159318f9" -> null
      - id                    = "/subscriptions/8e490e06-ec73-4972-88b1-1e89d8aabe8c/resourceGroups/wus-rg/providers/Microsoft.Network/virtualNetworks/virtualNetwork1" -> null
      - location              = "westus" -> null
      - name                  = "virtualNetwork1" -> null
      - resource_group_name   = "wus-rg" -> null
      - subnet                = [
          - {
              - address_prefix = "10.0.1.0/24"
              - id             = "/subscriptions/8e490e06-ec73-4972-88b1-1e89d8aabe8c/resourceGroups/wus-rg/providers/Microsoft.Network/virtualNetworks/virtualNetwork1/subnets/subnet1"
              - name           = "subnet1"
              - security_group = ""
            },
          - {
              - address_prefix = "10.0.2.0/24"
              - id             = "/subscriptions/8e490e06-ec73-4972-88b1-1e89d8aabe8c/resourceGroups/wus-rg/providers/Microsoft.Network/virtualNetworks/virtualNetwork1/subnets/subnet2"
              - name           = "subnet2"
              - security_group = ""
            },
          - {
              - address_prefix = "10.0.3.0/24"
              - id             = "/subscriptions/8e490e06-ec73-4972-88b1-1e89d8aabe8c/resourceGroups/wus-rg/providers/Microsoft.Network/virtualNetworks/virtualNetwork1/subnets/subnet3"
              - name           = "subnet3"
              - security_group = "/subscriptions/8e490e06-ec73-4972-88b1-1e89d8aabe8c/resourceGroups/wus-rg/providers/Microsoft.Network/networkSecurityGroups/NSGS1"
            },
          - {
              - address_prefix = "10.0.4.0/24"
              - id             = "/subscriptions/8e490e06-ec73-4972-88b1-1e89d8aabe8c/resourceGroups/wus-rg/providers/Microsoft.Network/virtualNetworks/virtualNetwork1/subnets/AzureFirewallSubnet"
              - name           = "AzureFirewallSubnet"
              - security_group = ""
            },
        ] -> null
      - tags                  = {
          - "environment" = "Production"
        } -> null
      - vm_protection_enabled = false -> null
    }

  # azurerm_virtual_network.wus-vnet will be created
  + resource "azurerm_virtual_network" "wus-vnet" {
      + address_space         = [
          + "10.0.0.0/16",
        ]
      + dns_servers           = [
          + "10.0.0.4",
          + "10.0.0.5",
        ]
      + guid                  = (known after apply)
      + id                    = (known after apply)
      + location              = "westus"
      + name                  = "virtualNetwork1"
      + resource_group_name   = "wus-rg"
      + subnet                = [
          + {
              + address_prefix = "10.0.1.0/24"
              + id             = (known after apply)
              + name           = "subnet1"
              + security_group = ""
            },
          + {
              + address_prefix = "10.0.2.0/24"
              + id             = (known after apply)
              + name           = "subnet2"
              + security_group = ""
            },
          + {
              + address_prefix = "10.0.3.0/24"
              + id             = (known after apply)
              + name           = "subnet3"
              + security_group = "/subscriptions/8e490e06-ec73-4972-88b1-1e89d8aabe8c/resourceGroups/wus-rg/providers/Microsoft.Network/networkSecurityGroups/NSGS1"
            },
          + {
              + address_prefix = "10.0.4.0/24"
              + id             = (known after apply)
              + name           = "AzureFirewallSubnet"
              + security_group = ""
            },
        ]
      + tags                  = {
          + "environment" = "Production"
        }
      + vm_protection_enabled = false
    }

Plan: 7 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  + azfw-ip = [
      + {
          + name                 = "configuration"
          + private_ip_address   = (known after apply)
          + public_ip_address_id = (known after apply)
          + subnet_id            = (known after apply)
        },
    ]
```

</details>

*Pusher: @namitjagtiani, Action: `pull_request`*